{
    "title": "Arduquarium",
    "content": "<div class=\"row\"><div class=\"col-lg-6\"><h1 class=\"shimmer\">Arduquarium: Automated Aquarium Water Cycler</h1><hr/><p>The Arduquarium is an automated aquarium water cycler project built using an Arduino UNO board that provides an automated solution for maintaining optimal water conditions in your aquarium while promoting sustainable water usage. By monitoring the pH level and water level in the aquarium, the system takes actions to ensure a healthy environment for your aquatic pets and simultaneously recycles water for plant nourishment.</p></div><div class=\"col-lg-6\"><a href=\"./assets/images/projects/project_14.png\"><img src=\"./assets/images/projects/project_14.png\" width=\"100%\" /></a></div></div><br/><center><a class=\"btn-reactive-a\" href=\"https://github.com/nthnn/Arduquarium\" target=\"_blank\"><button class=\"btn-reactive btn-lg\"><div class=\"i-wrapper\"><i class=\"lni lni-github no-rotate\"></i></div><span class=\"lead\">Get on GitHub</span></button></a></center><br/><h2 class=\"shimmer\">How It Works</h2><hr/><p>The Automated Aquarium Water Cycler is an Arduino-based project designed to maintain optimal water conditions in your aquarium while promoting sustainable water usage and supporting plant growth. By continuously monitoring the pH level of the aquarium water, the system automatically pumps out water if the pH falls below 6.5 or exceeds 7.5. The water that is pumped out is redirected to water the plants positioned above the aquarium, utilizing its nutrients for plant nourishment.</p><p>To ensure the aquarium's water level remains at an appropriate level, the system incorporates a water sensor. If the water level in the aquarium is detected to be insufficient, the system activates the pump to refill the aquarium with water. This water is sourced from the filtered water collected from the plants, providing a continuous cycle of water circulation and conservation.</p><p>With the Arduquarium, you can effortlessly maintain a healthy pH balance in your aquarium, while simultaneously promoting the growth of plants and minimizing water waste.</p><br/><h2 class=\"shimmer\">Features</h2><hr/><ul><li><u>pH Level Monitoring</u>: The system incorporates a pH sensor that continuously measures the pH level of the aquarium water. If the pH level falls below 6.5 or rises above 7.5, the system takes corrective action.</li><li><u>Water Pump and Drainage System</u>: When an imbalance in pH is detected, the system activates a water pump, efficiently draining water from the aquarium. The water is then directed to a container placed above the aquarium.</li><li><u>Plant Nourishment</u>: The container above the aquarium is designed to hold plants, which benefit from the nutrients present in the aquarium water. As the drained water fills the container, the plants are nourished, providing a natural filtration process and promoting sustainable water usage.</li><li><u>Automated Refill</u>: The system includes a water level sensor that constantly monitors the water level in the aquarium. When the water level falls below a predetermined minimum, the system triggers the refill process.</li><li><u>Efficient Water Management</u>: The filtered water from the plant container, enriched with nutrients and filtered through the plant's root systems, is redirected back into the aquarium, replenishing the water level. This ensures efficient water usage and minimizes waste.</li></ul>"
}