{
    "title": "VoxHAUT Roamer",
    "content": "<h1 class=\"shimmer\">VoxHAUT Roamer</h1><hr/><p>VoxHAUT combines various technologies such as the ESP8266 NodeMCU 1.0 microcontroller unit, the ESP8266 L293DD Motor Shield, AHT20 and BMP280 sensor, JQ8400 audio synthesis module, OLED 0.96 inch display, and HR-SC04 ultrasonic sensor. Designed to function as a pet companion, VoxHAUT integrates seamlessly with Android through a Wi-Fi connection, enabling users to interact and communicate with it effectively.</p><br/><div class=\"row\"><div class=\"col-lg-3\"><a href=\"./assets/images/projects/project_21_01.jpg\"><img src=\"./assets/images/projects/project_21_01.jpg\" width=\"100%\" /></a></div><div class=\"col-lg-3\"><a href=\"./assets/images/projects/project_21_02.jpg\"><img src=\"./assets/images/projects/project_21_02.jpg\" width=\"100%\" /></a></div><div class=\"col-lg-3\"><a href=\"./assets/images/projects/project_21_03.jpg\"><img src=\"./assets/images/projects/project_21_03.jpg\" width=\"100%\" /></a></div><div class=\"col-lg-3\"><a href=\"./assets/images/projects/project_21_04.jpg\"><img src=\"./assets/images/projects/project_21_04.jpg\" width=\"100%\" /></a></div></div><br/><p>The core of the VoxHAUT is the ESP8266 NodeMCU 1.0, a powerful microcontroller that serves as the central control unit. With built-in Wi-Fi capabilities, the NodeMCU facilitates wireless communication between VoxHAUT and the user devices, creating a seamless interface for interaction. This connectivity allows users to control VoxHAUT, receive real-time data, and trigger emotional responses, enhancing the overall interactive experience.</p><p>While, the hardware components of the VoxHAUT includes various sensors and modules that contribute to its functionality. The on-board AHT20 and BMP280 sensors enable environmental monitoring by providing accurate measurements of temperature, humidity, and atmospheric pressure. These sensors offer users valuable insights into its surroundings.</p><p>The integration of the JQ8400 audio synthesis module allows the VoxHAUT to communicate audibly with users, enhancing its interactive capabilities. Through voice synthesis and audio playback, the VoxHAUT can provide sentence response and engage users in a more immersive manner.</p><p>Moreover, the OLED 0.96&#34; Display serves as the visual interface of VoxHAUT, conveying emotions and displaying important information such as status updates and environmental data. This clear and vibrant display enables users to interpret the VoxHAUT's current state and interact accordingly, fostering a deeper connection between users and the robot.</p><br/><center><a class=\"btn-reactive-a\" href=\"https://github.com/nthnn/VoxHAUT-Roamer\" target=\"_blank\"><button class=\"btn-reactive btn-lg\"><div class=\"i-wrapper\"><i class=\"lni lni-github no-rotate\"></i></div><span class=\"lead\">Get on GitHub</span></button></a></center><br/><h2 class=\"shimmer\">Features</h2><hr/><ul><li><u>Android App Interaction</u>: Users can control and interact with the VoxHAUT with an Android application. The Android app is developed using TypeScript and ReactJS and wrapped within an Android WebView written in Kotlin.<br/><br/><div class=\"row\"><div class=\"col-lg-4\"><a href=\"./assets/images/projects/project_21_05.png\"><img src=\"./assets/images/projects/project_21_05.png\" width=\"100%\" /></a></div><div class=\"col-lg-4\"><a href=\"./assets/images/projects/project_21_06.png\"><img src=\"./assets/images/projects/project_21_06.png\" width=\"100%\" /></a></div><div class=\"col-lg-4\"><a href=\"./assets/images/projects/project_21_07.png\"><img src=\"./assets/images/projects/project_21_07.png\" width=\"100%\" /></a></div></div><br/></li><li><u>WiFi Connectivity</u>: The VoxHAUT utilizes the ESP8266 NodeMCU 1.0 microcontroller unit to establish a wireless connection with Android application via WiFi. This allows seamless interaction between the user and the robot, enabling a wide range of functionalities and commands.</li><li><u>Emotional Display</u>: The VoxHAUT features an OLED 0.96 inch display that visually expresses emotions such as happiness, sadness, and idleness. When users interact with VoxHAUT, it displays a happy emotion, creating a friendly and engaging atmosphere. In the absence of user interaction, the display shows a sad emotion, indicating VoxHAUT's longing for attention.</li><li><u>Audio Synthesis</u>: To enhance the interactive experience, the VoxHAUT incorporates the JQ8400 audio synthesis module. It is capable of generating synthesized speech, sound effects, and music. This feature enables the robot to communicate with the user in a more engaging and expressive manner.</li><li><u>Environmental Sensors</u>: The on-board AHT20 and BMP280 sensors enables VoxHAUT to monitor its surroundings. The AHT20 sensor measures temperature and humidity, while the BMP280 sensor provides atmospheric pressure and temperature data.</li><li><u>Obstacle Avoidance</u>: VoxHAUT employs ultrasonic sensors to mimic the depiction of eyes and facilitate obstacle avoidance. By measuring the distance to nearby objects, it can autonomously navigate its environment, avoiding potential collisions. This safety feature ensures the smooth operation of the robot while ensuring the well-being of both the robot and its surroundings.</li></ul>"
}