{
    "title": "Monitoria",
    "content": "<h1 class=\"shimmer\">Monitoria</h1><hr/><div class=\"row\"><div class=\"col-lg-7\"><p>In today's fast-paced world, efficient attendance management is a critical aspect for individuals, communities, businesses, and organizations alike. The Monitoria attendance monitoring system offers a comprehensive solution that leverages RFID technology, a desktop web-based application, and real-time communication to streamline attendance tracking. By utilizing this system, individuals, communities, businesses, and organizations can experience a range of benefits that enhance operational efficiency, data accuracy, security, and overall productivity.</p><a class=\"btn-reactive-a\" href=\"https://github.com/nthnn/Monitoria\" target=\"_blank\"><button class=\"btn-reactive btn-lg\"><div class=\"i-wrapper\"><i class=\"lni lni-github no-rotate\"></i></div><span class=\"lead\">Get on GitHub</span></button></a><br class=\"mobile-break\"/></div><div class=\"col-lg-5\"><a href=\"./assets/images/projects/project_22.png\"><img src=\"./assets/images/projects/project_22.png\" width=\"100%\" /></a></div></div><br/><p>Monitoria is a comprehensive attendance monitoring system that utilizes an ESP8266 microcontroller unit along with an RFID sensor to record attendance logs. This project also includes a user-friendly desktop web-based application built with ElectronJS, enabling administrators to monitor attendance logs, manage entities, and save logs as CSV files. The system incorporates various features such as real-time LCD I2C display on the ESP8266, SMS notifications to entities upon tapping their RFID cards or handheld keys, and error handling for unregistered RFIDs. The communication between the desktop application and the ESP8266 is established through a WiFi connection, with the ESP8266 acting as an access point.</p><br/><a href=\"./assets/images/projects/project_22_01.png\"><img src=\"./assets/images/projects/project_22_01.png\" width=\"100%\" /></a>"
}