{
    "title": "PortaMob",
    "content": "<h1 class=\"shimmer\">PortaMob</h1><hr/><p>PortaMob shield is an ingenious extension for the Arduino UNO platform. The shield aims to replicate the functionality of a portable mobile device, incorporating a 3x3 button grid, a monochromatic OLED display, a 24LC256 EEPROM IC, and various communication interfaces' header pins.</p><center><a href=\"assets/images/projects/project_25_01.jpeg\"><img src=\"assets/images/projects/project_25_01.jpeg\" class=\"w-sm-100 w-md-75 w-25\" /></a></center><br/><h3 class=\"shimmer border-secondary border-bottom\">Key Components</h3><ul><li><b>Monochromatic OLED display</b> &mdash; A 0.96-inch OLED display serves as the visual output interface. It can display text, graphics, and basic animations, mimicking the screen of a mobile device.</li><li><b>Button Grid</b> &mdash; The shield includes a 3x3 button grid, reminiscent of traditional mobile phone keypads. Each button is programmable, allowing for a wide range of interactions and functionalities.</li><li><b>EEPROM Memory</b> &mdash; The onboard 24LC256 EEPROM IC provides non-volatile memory storage. This feature is valuable for retaining data even after power cycles, enabling storage of configuration settings, user preferences, and other critical data.</li><li><b>Communication Header Pins</b> &mdash; Header pins for UART, I2C, digital I/O, and analog inputs expand the shield's capabilities. It can interact with external devices, sensors, and peripherals through these communication interfaces.</li></ul><br/><h3 class=\"shimmer border-secondary border-bottom\">Why PortaMob?</h3><ul><li><b>Design Philosophy</b><br/><p class=\"mt-2\">The development of the PortaMob shield is underpinned by a thoughtful design philosophy that prioritizes usability, adaptability, and pedagogical value. The button grid and OLED display were strategically selected to mirror the intuitive interface of conventional mobile devices. The EEPROM memory and communication interfaces amplify the shield's pragmatic applications.</p><br/><div class=\"row\"><div class=\"col-6\" align=\"center\"><img src=\"assets/images/projects/project_25_02.svg\" class=\"w-75\" /></div><div class=\"col-6\" align=\"center\"><img src=\"assets/images/projects/project_25_03.svg\" class=\"w-75\" /></div></div></li><li><b>Programmable Functionality and Applications</b><p class=\"mt-2\">The PortaMob shield's programmable attributes transcend both hardware and software domains. By programming the push buttons, users can allocate distinct functions such as navigation, selection, or activation of predefined actions. The OLED display's potential extends to rendering textual information, dynamic menus, or even basic games. The EEPROM memory opens avenues for projects necessitating data storage, retrieval, and manipulation.</p></li><li><b>Accelerated Prototyping and Simulation</b><p class=\"mt-2\">For advanced users, the PortaMob shield offers an expedited platform for prototyping and simulation. It empowers developers to conceptualize and trial mobile-inspired applications, user interfaces, and interaction models prior to transitioning to dedicated hardware or software frameworks. This capability substantially streamlines the development lifecycle and optimizes design iterations.</p></li></ul><br/><div align=\"center\"><a class=\"btn-reactive-a\" href=\"https://github.com/nthnn/PortaMob\" target=\"_blank\"><button class=\"btn-reactive btn-lg\"><div class=\"i-wrapper\"><i class=\"lni lni-github no-rotate\"></i></div><span class=\"lead\">Get on GitHub</span></button></a></div>"
}