{
    "title": "Hopia",
    "content": "<h1 class=\"shimmer\">Hopia</h1><hr/><div class=\"row\"><div class=\"col-lg-6\"><p>Hopia is a powerful and versatile wannabe penetration testing tool designed for ethical and legitimate security testing purposes. It provides a range of wannabe security testing capabilities to help assess and enhance the security of systems and networks.</p><p>It is also important to note that Hopia is intended to be used responsibly, within the boundaries of the law, and with proper authorization from system owners or administrators. Any malicious or unauthorized use of this software is strictly prohibited and may result in legal consequences.</p></div><div class=\"col-lg-6\" align=\"center\"><img src=\"assets/images/projects/project_26_01.png\" width=\"320px\" /></div></div><br class=\"mobile-break\"/><h3 class=\"shimmer border-secondary border-bottom\">Features</h3><ul><li><b>DDoS Testing</b><p>Simulate Distributed Denial of Service (DDoS) attacks to assess the resilience of your systems against such threats. Only use this feature with proper authorization on systems you own or have explicit permission to test.</p></li><li class=\"mt-2\"><b>Hash Cracking</b><p>Attempt to crack hash strings using popular algorithms like MD5, SHA-1, and SHA-256. This feature should only be used for legitimate purposes, such as password recovery on systems where you have explicit authorization.</p></li><li><b>Admin Page Finder</b><p>Find and discover administrator login pages on websites using a file containing list of common URLs. Always use this feature responsibly and only on websites for which you have proper and legal authorization.</p></li><li><b>Port Scanning</b><p>Scan for open ports from a given host URL in order to identify potential vulnerabilities. As always, ensure you have legal permission and authorization to scan the target system before using this feature.</p></li></ul><div align=\"center\"><a class=\"btn-reactive-a\" href=\"https://github.com/nthnn/Hopia\" target=\"_blank\"><button class=\"btn-reactive btn-lg\"><div class=\"i-wrapper\"><i class=\"lni lni-github no-rotate\"></i></div><span class=\"lead\">Get on GitHub</span></button></a></div>"
}