{
    "title": "N2CMU",
    "content": "<h1 class=\"shimmer\">N2CMU</h1><hr/><p>N2CMU is a project aimed at implementing a neural network coprocessing microcontroller unit (MCU) for STM32F103C8T6 Bluepill development board using the TinyGo (Go programming language for embedded systems). This MCU enables offloading feedforward neural network computations to a dedicated hardware unit, allowing for efficient and low-power feedforward neural network training and inference on small hardware embedded systems.</p><br/><div align=\"center\"><a class=\"btn-reactive-a\" href=\"https://github.com/nthnn/n2cmu\" target=\"_blank\"><button class=\"btn-reactive btn-lg\"><div class=\"i-wrapper\"><i class=\"lni lni-github no-rotate\"></i></div><span class=\"lead\">Get on GitHub</span></button></a></div><br/><h3 class=\"shimmer border-secondary border-bottom\">Features</h3><ul><li><b>Neural Network Coprocessing</b><p>N2CMU allows offloading feedforward neural network computations to a dedicated coprocessing unit, freeing up the main microcontroller for other tasks.</p></li><li><b>UART Communication</b><p>Communication with N2CMU is facilitated via UART, enabling external devices to control and interact with the coprocessing unit.</p></li><li><b>Flexible Configuration</b><p>N2CMU supports dynamic configuration of neural network parameters such as input, hidden, and output neuron counts, as well as weights, biases, and gradients.</p></li><li><b>Training and Inference</b><p>The coprocessing unit supports both training and inference modes, allowing for the optimization of neural network models directly on the microcontroller.</p></li></ul><br/><div class=\"row\"><div class=\"col-lg-6\"><a href=\"./assets/images/projects/project_36_02.jpg\"><img src=\"./assets/images/projects/project_36_02.jpg\" width=\"100%\" /></a></div><div class=\"col-lg-6\"><a href=\"./assets/images/projects/project_36_01.png\"><img src=\"./assets/images/projects/project_36_01.png\" width=\"100%\" /></a></div></div>"
}