{
    "title": "Uartix",
    "content": "<h1 class=\"shimmer\">Uartix Programming Language</h1><hr/><p>A strange dynamic programming language that performs mathematical computations on a connected Raspberry Pi Pico through UART connectivity.</p><div class=\"overflow-auto w-auto\" style=\"border:solid var(--bs-gray);border-width:.1em .1em .1em .8em;padding:.2em .6em;\"><pre style=\"margin: 0; line-height: 125%\"><span class=\"text-success\"># Hello world example</span><br/><br/>greet = <span class=\"text-danger\">func</span>(name)<br/>    <span class=\"text-danger\">render</span> <span class=\"text-warning\">&quot;Hello, &quot;</span> + name;<br/><br/>greet(<span class=\"text-warning\">&quot;world&quot;</span>);</pre></div><br/><p>See the complete documentation <a href=\"https://uartix.vercel.app/\" class=\"text-decoration-none\">here</a>.</p><div align=\"center\"><a class=\"btn-reactive-a\" href=\"https://github.com/nthnn/Uartix\" target=\"_blank\"><button class=\"btn-reactive btn-lg\"><div class=\"i-wrapper\"><i class=\"lni lni-github no-rotate\"></i></div><span class=\"lead\">Get on GitHub</span></button></a></div><br/><h3 class=\"shimmer border-secondary border-bottom\">Why Uartix?</h3><p>Despite its unconventional and dynamic behavior, as well as its lack of fundamental APIs, Uartix can still serve as a general-purpose programming and scripting language. The following points outline the reasons behind the development of Uartix:</p><ul><li>The Raspberry Pi Pico, with its dual-core ARM Cortex-M0+ processor, offers an irrelevant yet affordable platform for hardware-level computation.</li><li>Uartix provides a specialized environment where developers can perform mathematical operations directly on the hardware.</li><li>Compared to many external coprocessors, Uartix running on a Raspberry Pi Pico presents a highly cost-effective solution. The affordability of the Pico reduces overall project costs while still delivering substantial computational power for a variety of applications.</li><li>The Raspberry Pi Pico, with its energy-efficient ARM Cortex-M0+ cores, offers a low-power solution for performing mathematical calculations which is perfect for Uartix runtime execution.</li><li>Why not? I was bored when I started developing this.</li></ul>"
}