{
    "title": "Minimal Data Image Format",
    "content": "<h1 class=\"shimmer\">Minimal Data Image Format</h1><hr/><p>MDIF (Minimal Data Image Format) is a simple and efficient image format designed for use with Diwa, a lightweight implementation of Artificial Neural Networks. MDIF is optimized for environments with limited resources, such as microcontrollers with (specially MCUs with PSRAM), but it is also suitable for desktop environments.</p><div align=\"center\"><a href=\"./assets/images/projects/project_43_01.png\"><img src=\"./assets/images/projects/project_43_01.png\" /></a></div><p>MDIF is designed to have a minimalistic image data structure that balances simplicity for functionality. It provides essential image handling capabilities while being lightweight enough to be used in resource-constrained environments. The primary use case for MDIF is with Diwa, a neural network library that supports various platforms.</p><br/><div align=\"center\"><a class=\"btn-reactive-a\" href=\"https://github.com/nthnn/mdif\" target=\"_blank\"><button class=\"btn-reactive btn-lg\"><div class=\"i-wrapper\"><i class=\"lni lni-github no-rotate\"></i></div><span class=\"lead\">Get on GitHub</span></button></a></div><br/><h3 class=\"shimmer border-secondary border-bottom\">Features</h3><ul><li><b>Minimal and Efficient Data Structure</b><p>MDIF is designed with a focus on minimalism and efficiency. The data structure is intentionally simple, consisting of a signature for format identification, dimensions for width and height, and separate pointers for red, blue, green, and alpha color channels. This structure minimizes overhead and ensures that the image data can be processed quickly and easily, even in environments with limited resources.</p></li><li><b>Support for RGBA Color Model</b><p>MDIF supports the RGBA (Red, Green, Blue, Alpha) color model, which provides a comprehensive way to represent color images. The separate channels for red, green, blue, and alpha allow for detailed manipulation of image data, including transparency handling via the alpha channel.</p></li><li><b>Tools for Converting Between MDIF and Popular Image Formats (PNG, JPG)</b><p>MDIF includes tools for converting between MDIF and popular image formats such as PNG and JPG. These tools enable users to easily convert images to MDIF for efficient storage and processing, and then convert them back to standard formats for display or distribution.</p></li><li><b>Viewing Tools for Both Windows and Linux</b><p>MDIF comes with viewing tools that allow users to display MDIF images on both Windows and Linux platforms. These tools provide a straightforward way to visualize MDIF images, ensuring that users can quickly verify the contents of their image files.</p></li></ul>"
}